app/views/likes/_like.html.slim

SELECT "post_likes".* FROM "post_likes" WHERE "post_likes"."post_id" = 10 AND "post_likes"."user_id" = 1 LIMIT 1
---
- if user_signed_in?
  - @like = post.likes.find_by(user_id: current_user)