app/views/posts/_post.html.slim

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1
---
    strong Category:
    =< Category.find(post.category_id).name