app/views/posts/show.html.slim

SELECT COUNT(*) FROM "post_likes" WHERE "post_likes"."post_id" = 10
---
  .likes-section
    span = @post.likes.count

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = 3
SELECT 1 AS one FROM "post_comments" WHERE "post_comments"."post_id" = 10 LIMIT 1
---

- if @post.comments.any?