app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.build(comments_params)
    @comment.user = current_user

    if @comment.save
      redirect_to post_path(@post), notice: t('comment.actions.created')
---
INSERT INTO "post_comments" ("content", "post_id", "user_id", "created_at", "updated_at", "ancestry") VALUES ('THIRD', 3, 1, '2025-02-14 22:47:48.730900', '2025-02-14 22:47:48.730900', '/11/') RETURNING "id"
INSERT INTO "post_comments" ("content", "post_id", "user_id", "created_at", "updated_at", "ancestry") VALUES ('fsdkf', 3, 1, '2025-02-11 21:34:34.483508', '2025-02-11 21:34:34.483508', '/') RETURNING "id"

  def destroy
    @comment = PostComment.find(params.expect(:id))
    if @comment.user == current_user
      @comment.destroy!

      redirect_to post_path(@post), notice: t('comment.actions.deleted')
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = 3 LIMIT 1
DELETE FROM "post_comments" WHERE "post_comments"."id" = 5
DELETE FROM "post_comments" WHERE "post_comments"."id" = 1