app/controllers/likes_controller.rb

SELECT "post_likes".* FROM "post_likes" WHERE "post_likes"."post_id" = ? AND "post_likes"."user_id" = ? LIMIT ?  [["post_id", 980190962], ["user_id", 980190962], ["LIMIT", 1]]
UPDATE "posts" SET "likes_count" = COALESCE("likes_count", 0) + ? WHERE "posts"."id" = ?  [["likes_count", 1], ["id", 980190962]]
INSERT INTO "post_likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (10, 1, '2025-02-15 17:26:48.873990', '2025-02-15 17:26:48.873990') RETURNING "id"
---
  def create
    @like = @post.likes.find_by(user: current_user)

    if @like.nil?
      @like = @post.likes.build(user: current_user)
      if @like.save

SELECT "post_likes".* FROM "post_likes" WHERE "post_likes"."post_id" = 10 AND "post_likes"."id" = NULL LIMIT 1
DELETE FROM "post_likes" WHERE "post_likes"."id" = 1
---
  def destroy
    @like = @post.likes.find(params[:id])

    @like.destroy if @like.user == current_user