app/controllers/posts_controller.rb

  def create # rubocop:disable Metrics/MethodLength
    @post = Post.new(post_params)
    @post.creator = current_user if @post.new_record?

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "category_id", "user_id", "created_at", "updated_at") VALUES ('лодлов', 'длывадлыв', 4, 2, '2025-02-09 15:38:06.427403', '2025-02-09 15:38:06.427403') RETURNING "id"

  def update # rubocop:disable Metrics/MethodLength
    if @post.creator == current_user
      respond_to do |format|
        if @post.update(post_params)
---
UPDATE "posts" SET "body" = 'first body 1', "updated_at" = '2025-02-14 22:42:50.504207' WHERE "posts"."id" = 3

  def destroy
    if @post.creator == current_user
      @post.destroy!
---
DELETE FROM "posts" WHERE "posts"."id" = 3

  def set_post
    @post = Post.find(params.expect(:id))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 3 LIMIT 1